In [2]:
import pandas as pd

Series

In [3]:
x=[1, 2, 3, -4, 5, 62, 7, 118, 9]
dic = {'name': ['python', 'c++'], 'rank':[1,2], 'user':[212,232]}
var = pd.Series(x)
var1 = pd.Series(x, dtype='float', name='first')
var2 = pd.Series(dic)
var3 = pd.Series(12, index=[1,2,3,4])

DataFrame

In [4]:
x=[1, 2, 3, -4, 5, 62, 7, 118, 9]
var1 = pd.DataFrame(x)
var2 = pd.DataFrame(dic) #no. of data should be equal
var3 = pd.DataFrame(dic, columns=['user', 'rank', 'l'], index=['a', 'k'])

#Using two series as a value and two keys we can make data frames.
d = {'a': pd.Series([1,2,3,4,5]), 'b': pd.Series([9,8,7,6,5])}
v = pd.DataFrame(d)

Csv file reading and conversion

In [5]:
# Convertting dictonary or data to csv file.
data = {'name': ['python', 'c++'], 'rank':[1,2], 'user':[212,232]}
d = pd.DataFrame(data)

#whatever extension you write it make.
d.to_csv('first2.csv', index=False, header=['a', 'b', 'c'])

# #You can't write index like this.
# d.to_csv('first1.csv', index=['f', 'g', 'j'], header=['a', 'b', 'c'])

In [6]:
#reading csv file:
data = pd.read_csv('people.csv')
# data = pd.read_csv('people.csv', nrows=3, usecols=[0, 4], skiprows=[0], index_col="Name", header=2, col = ["col1", "col2"])
# data = pd.read_csv('people.csv', header=None, dtype={"Graduation": "float"}, names = ["col1", "col2", "col3", "col4", "col5", "col6"])
# print(type(data))

In [7]:
df = pd.read_csv("titanic.csv")
# df.loc[0]
# df.reset_index(inplace=True, drop=True)
# lst = [1 for x in range(891)]
# df.index=lst
# x=df[df["Survived"]==0]
# len(x)
# # for multiple condition use &
# df["Pclass"].value_counts()
# df[["Survived", "Sex"]].value_counts()

In [8]:
df.columns
df["Age"].mean()
df["Age"].max()
df["Age"].min()
df["Age"].std()
df["Age"].median()
df["Age"].mode()
df["Age"].count()
df["Age"].unique()
df["Age"].nunique()

88

In [9]:
df["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [10]:
df["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [11]:
df[["Sex", "Survived"]].value_counts()

Sex     Survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [12]:
df[["Sex", "Survived"]].value_counts()

Sex     Survived
male    0           468
female  1           233
male    1           109
female  0            81
Name: count, dtype: int64

In [13]:
468/577

0.8110918544194108

In [14]:
df["Age_Months"]=df["Age"]*12
df["Age_Months"].mean()

356.38941176470587

In [15]:
df.iloc[647]

PassengerId                                    648
Survived                                         1
Pclass                                           1
Name           Simonius-Blumer, Col. Oberst Alfons
Sex                                           male
Age                                           56.0
SibSp                                            0
Parch                                            0
Ticket                                       13213
Fare                                          35.5
Cabin                                          A26
Embarked                                         C
Age_Months                                   672.0
Name: 647, dtype: object

In [16]:
df.index = df["Ticket"]

In [17]:
df.loc['211536'] #this with work with level not index.

PassengerId                      887
Survived                           0
Pclass                             2
Name           Montvila, Rev. Juozas
Sex                             male
Age                             27.0
SibSp                              0
Parch                              0
Ticket                        211536
Fare                            13.0
Cabin                            NaN
Embarked                           S
Age_Months                     324.0
Name: 211536, dtype: object

In [18]:
df.loc["W./C. 6607"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Months
Ticket,,,,,,,,,,,,,
W./C. 6607,784,0,3,"Johnston, Mr. Andrew G",male,NaN,1,2,W./C. 6607,23.45,NaN,S,NaN
W./C. 6607,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,NaN

In [19]:
df.loc["STON/O2. 3101282"]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                            7.925
Cabin                             NaN
Embarked                            S
Age_Months                      312.0
Name: STON/O2. 3101282, dtype: object

In [27]:
df.reset_index(drop=True, inplace=True)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Months
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,264.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,456.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,312.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,420.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,420.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,324.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,228.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,312.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,384.0

In [32]:
df.iloc[400]
df[df["Age"]<=10].count()

PassengerId    64
Survived       64
Pclass         64
Name           64
Sex            64
Age            64
SibSp          64
Parch          64
Ticket         64
Fare           64
Cabin          10
Embarked       64
Age_Months     64
dtype: int64

In [36]:
df[(df["Fare"]<=20) & (df["Sex"]=="male")].count()

PassengerId    373
Survived       373
Pclass         373
Name           373
Sex            373
Age            281
SibSp          373
Parch          373
Ticket         373
Fare           373
Cabin           12
Embarked       373
Age_Months     281
dtype: int64

In [37]:
df[(df["Age"]>=50) & (df["Sex"]=="female")].count()

PassengerId    22
Survived       22
Pclass         22
Name           22
Sex            22
Age            22
SibSp          22
Parch          22
Ticket         22
Fare           22
Cabin          15
Embarked       21
Age_Months     22
dtype: int64

In [47]:
len(df[(df["Survived"]==1) & (df["Age"]>=40)])
df[(df["Survived"]==1) & (df["Age"]>=40)].count()
# df

PassengerId    61
Survived       61
Pclass         61
Name           61
Sex            61
Age            61
SibSp          61
Parch          61
Ticket         61
Fare           61
Cabin          37
Embarked       60
Age_Months     61
dtype: int64